[
    {
        "Title": "The Same Celebrities Who Shilled Crypto Are Now Turning Themselves Into Facebook's AI Chatbots",
        "Article Content": "Last month, Meta-formerly-Facebook CEO Mark Zuckerberg got on stage to unveil a slew of new AI chatbots, many of which are based top-tier celebrities from sports and television.\nThere's a \"wisecracking sports debater\" called Bru, based on NFL legend Tom Brady. There's Tamika, an \"anime-obsessed cosplay expert,\" based on Japanese tennis player Naomi Osaka. Calvin \"Snoop Dogg\" Broadus Junior will be your next \"Dungeon Master,\" while Paris Hilton will help you solve whodunnits as \"Amber.\"\nAll told, Meta announced a whopping 28 AIs that you can message on the company's various platforms. Roughly half are based on real-life celebrities, albeit with modified names, some of whom raked in millions for the deals.\nAnd as it turns out, an astonishing number of those celebrities previously cashed in on cryptocurrencies and NFTs — or at least they did back before markets bottomed out. Some of them even actively promoted FTX, the collapsed crypto empire whose founder Sam Bankman-Fried is on trial this week for defrauding investors of billions of dollars.\nIn other words, the shameful \"crypto to AI pipeline\" is hitting a fever pitch, with stars ditching web3 in favor of the latest cash grab.\nBy our count, three out of the initial 14 celebrities listed in Meta's announcement last month were either directly or indirectly invested in FTX. Two of them, Brady and Osaka, were actually sued over misleading their fans by shilling the exchange.\nIn March 2022, roughly eight months before FTX's collapse, Osaka became an FTX \"global ambassador,\" receiving an equity stake in the company. Brady, also once an FTX ambassador, was featured in TV commercials that promoted the exchange as \"the most trusted\" institution. He was reportedly paid $55 million for roughly 60 hours of work.\nAnd Kendall Jenner's 818 Tequila brand was also embroiled in a $700 million lawsuit involving FTX.\nOutside of FTX, plenty of other celebrities who've signed up for Meta's AI chatbot treatment have also extensively shilled crypto, including Snoop Dogg, who has launched several NFT collections and has been involved in many crypto schemes.\nSimilarly, Hilton is no stranger to the non-fungible tokens, going as far as to show off her own NFT series during an appearance on the \"Tonight Show Starring Jimmy Fallon\" last year.\nSocial media personalities Jimmy \"MrBeast\" Donaldson, Charli D'Amelio, and Lauren \"LaurDIY\" Riihimaki, who've also agreed to be turned into Meta AIs, have promoted crypto in the past. In a 2021 interview with YouTuber Logan Paul, MrBeast revealed he had invested $1.5 million in Bitcoin. LaurDIY has an entire Instagram account dedicated to \"all things crypto, NFTs, Web3.\"\nIn a sense, at least the stakes aren't as high compared to the still-ongoing FTX debacle. So what if an AI-generated version of your face is being plastered on some lazily put-together social media accounts run by Meta — at least you aren't encouraging your fans to buy into some sort of get-rich-quick scheme.\nAt the end of the day, maybe none of this should be surprising. With cryptocurrency and NFT markets in dire straits, these public figures are looking to jump on the next bandwagon. And who could blame them for chasing the paper? Given the astronomical amount of hype surrounding AI these days, there's a lot of cash being thrown around.",
        "Link on the Article": "https://futurism.com/celebrities-shilled-crypto-facebooks-ai-chatbots"
    },
    {
        "Title": "Facebook Is Paying Celebrities Millions to Turn Them Into Chatbots",
        "Article Content": "Facebook's parent company Meta is paying celebrities millions of dollars to let it turn them into silly AI chatbots — and to be honest, we're still not entirely sure why.\nAs The Information reports, one unnamed celebrity got as much as $5 million for a mere six hours of work to be turned into one of the AIs.\nLast month, Meta CEO Mark Zuckerberg announced the chatbots, which are based on the personalities of celebrities including Kendall Jenner, Tom Brady, YouTube creator James \"MrBeast\" Donaldson, and TikTok star Charli D'Amelio.\nAs of right now, they're limited to text only, but according to Meta's onstage demo, the company is looking to have these faux celebrities speak with users through video as well.\nBut what does Meta get for its millions of dollars of investments? Besides, who exactly are these chatbots for?\nZuckerberg, for one, is convinced of the tech, telling The Verge last month that there's a \"huge need\" and that \"people want to interact with Kylie,\" referring to the \"Keeping Up With the Kardashians\" star, adding that \"it'll be fun for consumers.\" (While Kylie Jenner isn't currently on Meta's list of celebrity chatbots, her sister Kendall Jenner is.)\nWhether there's any truth to Zuckerberg's sentiment remains to be seen. And given the reactions so far, which have been mixed to say the least, the feature could turn out to be nothing more than a short-lived and ill-advised attempt to cash in on the current hype around AI.\nFor one, the marketing has been nothing less than confusing. Instead of explicitly selling these AI personalities by using their real names, Meta has given each chatbot an altered moniker, perhaps in an attempt to preempt any potential defamation lawsuits. Jenner's chatbot is called \"Billie,\" for instance, while Brady's assistant is called \"Bru.\"\nBillie even got her own Instagram account, introducing herself in a perplexing video that may or may not have been the product of a generative AI itself.\n\"Chatting with me is like having an older sister you can talk to, but who can’t steal your clothes,\" the bot wrote in the video's caption.\nThe eerie clip clearly didn't hit the mark, with confused commenters calling it \"so creepy\" and \"honestly scary.\"\n\"Is this legal?\" one Instagram user wrote. \"Did Kendall consent to this?\"\nThen there's the question of having famous people give up their likeness to train an AI at all. As Jezebel points out, the Screen Actor's Guild, which is currently on strike, has warned of studios trying to scan background performers to avoid paying them more than \"one day's pay.\"\nThe union has demanded protections from developers exploiting actors by creating AI-generated works or reproducing their voices and likenesses without their explicit consent or remuneration.\nAs of right now, Meta's celebrity AIs are still in a limited beta, and considering the sheer amount of mayhem AI chatbots have caused over the past year or so, the company will likely tread very carefully, especially considering these celebrities' reputations are at stake.\nIn other words, it's presumably only a matter of time until users find ways to exploit these chatbots and skirt around Meta's guardrails. When they do, what will their celebrity sources think?\nAbove all, it's a perplexing attempt to shoehorn AI tech into Meta's existing products. Chances are celebs like Brady are simply looking to cash in, not unlike when he took $55 million to endorse the since-collapsed crypto exchange FTX.\nIn short, there's clearly some quick money to be made. But whether that'll remain the case remains to be seen, especially considering the fate of FTX and other NFT ventures that were heavily endorsed by celebrities before the market fell apart.",
        "Link on the Article": "https://futurism.com/facebook-paying-celebrities-millions-chatbots"
    },
    {
        "Title": "Elon Musk Is in Big Trouble Over the Israel-Palestine Violence",
        "Article Content": "As the Israel-Palestine crisis unfolds, a massive barrage of disinformation has hit X-formerly-Twitter — and regulators are watching in horror.\nManipulated and fake images are widely circulating on the platform, a dire situation compounded by X owner Elon Musk's gutting of the company's workforce, including its content moderation team, following his chaotic takeover last year.\nIn an \"urgent letter\" addressed to X owner Elon Musk, Thierry Breton, the European commissioner for the internal market, accused the platform of enabling the dissemination of \"illegal content and disinformation in the EU\" and ordered Musk to file a response \"within the next 24 hours,\" ensuring \"that your systems are effective, and report on the crisis measures taken.\"\nBreton also wrote that the \"violent and terrorist content that appears to circulate on your platform,\" after Musk made \"changes in public interest policies\" was leaving \"many European users uncertain.\"\nAt 24 hours since Breton shared his letter, Musk has yet to show any indication of interest in making changes to X's policies.\nIt didn't take long for the outspoken billionaire to respond to Breton's request, albeit without actually addressing the issue.\n\"Our policy is that everything is open source and transparent, an approach that I know the EU supports,\" Musk wrote in a confounding tweet. \"Please list the violations you allude to on 𝕏, so that that the public can see them.\"\nBreton didn't take kindly to the suggestion, telling Musk that it's \"up to you to demonstrate that you walk the talk.\"\nBy all indications, Musk has yet to officially write a response or make X's content policies sufficiently clear beyond telling Breton that \"we take our actions in the open.\"\nMusk's telltale gut reaction of doubling down on his laissez-faire vision is telling, especially he's been actively contributing to the issue himself. In a since-deleted tweet, Musk recommended that users follow two accounts that have historically spread dangerous lies and made antisemitic comments, as The Washington Post reports.\nIt's still unclear if the European Commission will end up taking action or imposing \"penalties\" due to non-compliance, as Breton's letter warns.\nThe EU's recently enacted Digital Services Act requires any platforms with more than 45 million monthly active users to scan for illegal content and take it down as well. Companies can get fined up to six percent of their global turnover if they don't comply with the new rules.\nThat kind of penalty could turn out to be a major hit for a platform that is already in deep financial turmoil.\nIn short, the Israel-Palestine conflict could be seen as the first major international crisis to stress test Musk's social media platform — and given his apparent disinterest in tackling disinformation, he appears to be failing miserably.",
        "Link on the Article": "https://futurism.com/elon-musk-trouble-israel-palestine-violence"
    },
    {
        "Title": "Save Up to 50% on Prime Day Deals on Laptops, TVs, Generators, and More",
        "Article Content": "It’s Amazon Prime Day in October and it’s a great time to get started on your holiday shopping or pick up some essentials while they're deeply discounted. Thousands of products are steeply discounted, and you have two days to take advantage of deals on tech, audio equipment, TVs, generators, home appliances, and more.\nAll of these Prime Day deals require an active Amazon Prime Membership. You can sign up here for a free 30-day trial.\nApple 2023 MacBook Air Laptop 15.3-inch $1,049 (was $1,299)\nMicrosoft Surface Pro 9 (2022), 13-inch  2-in-1 Tablet & Laptop $1,299.99 (was $1,599.99)\nMicrosoft Surface Laptop 5 (2022) $930 (was $1,299.99)\nApple 2022 MacBook Pro 13-inch Laptop with M2 chip $1,049 (was $1,249.99)\nSAMSUNG 14” Galaxy Book3 Pro Laptop Computer, 13th Gen Intel Core i7-1360P Processor / 16GB / 512GB $1,134.99 (was $1,449.99)\nSAMSUNG 16” Galaxy Book3 Pro Laptop Computer, 13th Gen Intel Core i7-1360P Processor / 16GB / 1TB $1,384.99 (was $1,749.99)\nSAMSUNG 15.6” Galaxy Book3 Laptop Computer, 13th Gen Intel Core i7-1355U Processor / 16 GB / 512GB $774.99 (was $999.99)\nSAMSUNG 16” Galaxy Book3 Pro Laptop Computer, 13th Gen Intel Core i7-1360P Processor / 16GB / 1TB $1,384.99 (was $1,749.99)\nSAMSUNG 15.6” Galaxy Book3 Laptop Computer, 13th Gen Intel Core i7-1360P Processor/16 GB/512GB, Thin $949.99 (was $1,199.99)\nSAMSUNG 14” Galaxy Book3 Pro Laptop Computer, 13th Gen Intel Core i7-1360P Processor / 16GB / 1TB 3 $1,309.99 (was $1,649.99)\nSAMSUNG 14” Galaxy Book3 Pro Laptop Computer, 13th Gen Intel Core i7-1360P Processor / 16GB / 512GB $1,134.99 (was $1,449.99)\nSAMSUNG Electronics Galaxy Book Odyssey Intel Laptop Computer 15.6″ LED Screen Intel Core i7 Process $965 (was $1,499.99)\nSAMSUNG Electronics Galaxy Book Odyssey Intel Laptop Computer 15.6″ LED Screen Intel Core i7 Processor $775 (was $1,399.99)\nSAMSUNG 16″ Galaxy Book3 Pro Business Laptop Computer/Windows 11 PRO / 32GB / 1TB, 13th Gen Intel $1,684.99 (was $2,049.99)\nSAMSUNG 15.6″ Galaxy Book3 Business Laptop Computer/Windows 11 PRO/16GB – 512GB/ 13th Gen Intel® Core $859.99 (Was $1,099.99)\nSAMSUNG 16″ Galaxy Book3 Pro Business Laptop Computer/Windows 11 PRO / 16GB / 512GB, 13th Gen Intel® $1,184.99 (was $1,449.99)\nSAMSUNG 14″ Galaxy Book3 Pro Business Laptop Computer/Windows 11 PRO / 16GB / 512GB, 13th Gen Intel® $1,109.99 (was $1,449.99)\nASUS C424MA-AS48F Chromebook C424, 14.0″ 180 Degree FHD NanoEdge Display, Intel Dual Core Celeron Processor $212.49 (was $249.99)  \nASUS C425TA-AS348FT Chromebook C425 Clamshell Laptop, 14″ FHD 4-Way NanoEdge Touch Screen, Intel Core $297.95 (was $329.99)\nASUS CX1500CNA-AS84F Chromebook CX1, 15.6″ Full HD NanoEdge Display, Intel Celeron N3350 Processor $235 (was $249.99)\nASUS Chromebook C423 14.0″ FHD NanoEdge Display with 180 Degree Hinge Intel Celeron N3350 -Processor $179.99 (was $238.99)\nASUS AiO M3400 All-in-One Desktop PC, 23.8-inch Full HD Anti-Glare Display, AMD Ryzen 5 5625U $729.99 (was $899.99)\nASUS ROG Strix G16 (2023) Gaming Laptop, 16” 16:10 FHD 165Hz, GeForce RTX 4070, Intel Core i9-13980H $1,679.99 (was $1,999.99)\nASUS ROG Strix Scar 15 Gaming Laptop, 15.6” 240Hz IPS QHD Display, NVIDIA GeForce RTX 3070 Ti, Intel $1,499.99 (was $2,049.99)\nASUS TUF Gaming A17 Gaming Laptop, 17.3” 144Hz FHD IPS-Type Display, AMD Ryzen 5 4600H, GeForce GTX $599.99 (was $799.99)\nASUS ROG Strix G17 (2022) Gaming Laptop, 17.3” 144Hz IPS FHD Display, NVIDIA GeForce RTX 3050 GPU $979.99 (was $1,199.99)\nASUS Zenbook Pro 14 Duo 14.5” 16:10 Touch Display, 120Hz Refresh Rate, ScreenPad Plus, Intel i9-1390 $1,899.99 (was $2,299.99)\nASUS Vivobook Pro 16X Laptop, 16” 16:10 Display, Intel Core i9-13980HX CPU, NVIDIA® GeForce® RTX™ 40 $1,799.99 (was $2,199.99)\nASUS Vivobook Go 15 L510 Thin & Light Laptop Computer, 15.6” FHD Display, Intel Celeron N4020 Processor $189.99 (was $249.99)\nASUS 2023 Vivobook 14 Laptop, 14” FHD (1920 x 1080) Display, Intel Core i5-1235U CPU, Intel Iris Xᵉ $399.99 (was $479.99)\nASUS ZenBook Pro Duo 15 UX582 Laptop, 15.6” OLED 4K Touch Display, i7-12700H, 16GB, 1TB, GeForce RTX $1,799.99 (was $2,499.99)\nASUS Vivobook Laptop L210 11.6″ Ultra Thin Laptop, Intel Celeron N4020 Processor, 4GB RAM, 128GB eMM $179.99 (was $249.99)\nAcer Chromebook Spin 314 Convertible Laptop | Intel Pentium Silver N6000 | 14″ HD Corning Gorilla Glass $339.99 (was $399.99)\nAcer Nitro 5 AN515-58-57Y8 Gaming Laptop | Intel Core i5-12500H | NVIDIA GeForce RTX 3050 Ti Laptop $699.99 (was $899.99)\nAcer Nitro 17 Gaming Laptop | AMD Ryzen 7 7840HS Octa-Core CPU | NVIDIA GeForce RTX 4060 Laptop GPU $1,049.99 (was $1,399.99)\nAcer Aspire 3 A315-24P-R7VH Slim Laptop | 15.6″ Full HD IPS Display | AMD Ryzen 3 7320U Quad-Core $249.99 (was $329.99)\nAcer Aspire TC-1760-UA92 Desktop | 12th Gen Intel Core i5-12400 6-Core Processor | 12GB 3200MHz DDR4 $499.99 (was $619.99)\nAcer Swift Go 14 Intel Evo Thin & Light Laptop 14″ 1920×1200 100% sRGB Touch Display Intel Core i7-1 $649.99 (was $899.99)\nAcer Aspire C27-1700-UA91 AIO Desktop | 27″ Full HD IPS Display | 12th Gen Intel Core i5-1235U $749.99 (was $899.99)\nAcer Aspire C24-1700-UA91 AIO Desktop | 23.8″ Full HD IPS Display | 12th Gen Intel Core i3-1215U $499.99 (was $649.99)\nDell Inspiron 7720 All in One Desktop – 27-inch FHD Touchscreen Display, Intel Core i7-1355U, 32GB $1,141.99 (was $1,399.99)\nDell Inspiron 16 5635 Laptop – AMD Ryzen 7-7730U, QHD 16 inch, 16GB LPDDR4x RAM, 1TB SSD, AMD Radeon $749.99 (was $999.99)\nDell G16 7630 Gaming Laptop – 16-inch (2560 x 1600) QHD+ 165Hz 3ms Display, Intel Core i9-13900HX $1,499.49 (was $1,789.99)\nDell G15 5530 Gaming Laptop – 15.6-inch FHD (1920×1080) Display, Intel Core i7-13650HX, 16GB $1,129.99 (was $1,449.99)\nDell Inspiron 15 3530 Laptop – Intel Core i5-1335U, 15.6-inch FHD 120Hz Display, 16GB DDR4 RAM $552.49 (was $649.99)\nDell Inspiron 3020S Desktop – Intel Core i5-13400, 16GB DDR4 RAM, 512GB SSD + 1TB HDD, Intel UHD 730 $584.99 (was $749.99)\nDell Inspiron 16 5630 Laptop – Intel Core i7-1360P, 16-inch 16:10 FHD+ Display, 16GB LPDDR5 RAM, 1TB $874.68 (was $1,129.99)\nHP 15.6 inch Laptop PC, Processor: 13th Generation Intel® Core™ i7 $758 (was $839.99)\nHP Pavilion Plus 14 inch Laptop, 2.8K OLED Display, 13th Generation Intel Core i7-1355U, 16 GB RAM $1,074.99 (was $1,299.99)\nHP All-in-One PC Desk Computer, 21.5″ Full HD Micro-Edge Display, AMD Ryzen 3 Processor, AMD Radeon $469.99 (Was $652.78)\nHP All-in-One Bundle PC, 27″ FHD Micro-Edge Display, 12th Generation Intel Core i7 Processor $889.99 (was $1,070.13)\nHP Envy x360 15-inch Laptop, FHD Display, Intel Core i7-1355U, 16 GB RAM, 1 TB SSD, Intel Iris Xe $854.99 (was $1,119.99)\nHP 15-inch Laptop, FHD Display, Intel Core i3-1215U, 8 GB RAM, 128 GB SSD, Intel UHD Graphics, Windows $319.99 (was $499.99)\nHP 15-inch Laptop, HD Display, AMD Ryzen 5 5500U, 8 GB RAM, 256 GB SSD, AMD Radeon Graphics, Windows $379.99 (was $499)\nHP 17-inch Laptop, HD+ Display, 12th Generation Intel Core i5-1235U, 8 GB RAM, 512 GB SSD $599.99 (was $729.99)\nLenovo 3i Chromebook – 2023 – Everyday Notebook – Chrome OS – 15.6″ Full HD – 8GB Memory – 64GB Storage $254.99 (was $299.99)\nLenovo IdeaCentre AIO 5i – 2022 – All-in-One Desktop – 27″ QHD Touch Display – 5MP + IR Camera $949.99 (was $1,249.99)\nLenovo IdeaCentre AIO 3-2022- All-in-One Desktop – 23.8″ FHD Touch Display – HD 720p Camera – Windows $599.99 (was $799.99)\nLenovo Legion Tower 5i – 2022 – Gaming Desktop – NVIDIA GeForce RTX 3070 $1,349.99 (was $1,679.99)\nLenovo Legion Tower 7 – 2022 – Gaming Desktop – NVIDIA GeForce RTX 3070 – Intel i9-12900 $1,699.99 (was $2,199.99)\nLenovo IdeaCentre AIO 5i – 2022 – All-in-One Desktop – 27″ QHD Touch Display – 5MP + IR Camera $949.99 (was $1,249.99)\nLenovo Legion Tower 5i – 2022 – Gaming Desktop – NVIDIA GeForce RTX 3070 – Intel i7-12700F $1,349.99 (was $1,679.99)\nLenovo IdeaPad Flex 5 – (2023) – Everyday Notebook – 2-in-1 Laptop – Windows 11 – 16″ WUXGA Touchscreen $734.99 (was $849.99)\nApple AirPods Pro (2nd Gen) Wireless Earbuds with USB-C $189 (was $249)\nBose QuietComfort Earbuds II True Wireless Active Noise Cancelling Technology Earbuds $199 (was $279)\nSony WF-1000XM5 True Wireless Bluetooth Noise-Canceling Earbuds $278 (was $299)\nSony LinkBuds True Wireless Earbuds with Open-Ring Design for situational awareness $128 (was $179)\nEarFun Air Pro 3 Noise-Cancelling Earbuds $55.99 ($49.83 w/ coupon PDAP3PR1, was $79)\nEarFun Air S Noise-Cancelling Wireless Earbuds $39.99 ($35.99 w/ coupon PD201PR1, was $59.99)\nJabra Elite 7 Active Noise Cancellation True Wireless Bluetooth Sports Earbuds $79.99 (was $179)\nJabra Elite 7 Pro Active Noise Cancellation True Wireless Bluetooth Earbuds w/ MultiSensor Voice Tech $113.99 (was $199)\nHouse of Marley Champion 2 True Wireless Earbuds 15% off (was $89)\nTREBLAB X3 Pro Earbuds $47.97 (was $99.97)\n1MORE PistonBuds Pro ANC Earbuds $39.99 (was $49.99)\nSkullcandy Grind True Wireless Earbuds $65.99 (was $79.99)\nSkullcandy Mod True Wireless Earbuds $36.99 (was $59.99)\nSkullcandy Jib 2 True Wireless Earbuds $27.99 (was $39.99)\nHIFIMAN Deva-Pro Over-Ear Open-Back Planar-Magnetic Headphones with Bluetooth 5.0 R2R DAC Receiver $199 (was $329)\nHIFIMAN HE-R10D Dynamic Topology Driver Close-Back Over-Ear Headphones with Bluemini R2R DAC Receiver $599 (was $1,299)\nSony WH-1000XM4 Wireless Premium Noise Canceling Overhead Headphones $248 (was $348)\nSony WH-CH720N Noise-Canceling Bluetooth Over The Ear Headset $98 (was $149)\nBose Headphones 700 Noise-Cancelling Bluetooth Over-Ear Wireless Headphone $279 (was $379)\nSennheiser HD 450BT Bluetooth 5.0 Wireless Headphone with Active Noise Cancellation $94 (was $129)\nbeyerdynamic DT 770 PRO 80 wired professional recording/mixing headphones $134 (was $169)\nbeyerdynamic TYGR 300 R Gaming Headset $159 (was $199)\nTREBLAB Z2 Over-Ear Headphones $69.95 ($119.97)\nTREBLAB Z7 Pro Hybrid Over-Ear Headphones $119 (was $179)\n1MORE SonoFlow ANC LDAC Hi-Res Headphones $74.99 (was $99.99)\nSkullcandy Hesh Evo Wireless Over Ear Headphones  $69.99 (was $104.99)\nSkullcandy Hesh ANC Wireless Over Ear Headphones $99.99 (was $134.99)\nSkullcandy Riff 2 Wireless Over Ear Headphones $34.99 (was $49.99)\nSkullcandy SLYR Pro Gaming Wireless Over Ear Headphones $75.31 (was $99.99)\nSkullcandy PLYR Gaming Wireless Over Ear Headphones $101.98 (was $129.99)\nSony SRS-XB13 EXTRA BASS Bluetooth Lightweight Travel Speaker, IP67 Waterproof $34 (was $59)\nJBL Charge 5 Portable Bluetooth Speaker $129 (was $179)\nJBL Go 3 Bluetooth Speaker $24 (was $49)\nJBL Flip 6 Bluetooth Speaker $89 (was $129)\nJBL Xtreme 2 $199 (was $429)\nJBL PartyBox Essential Encore $199 (was $299)\nHouse of Marley Bag of Riddim 2 Portable Speaker $199 (was $229)\nHouse of Marley Get Together Bluetooth Portable Audio System $129 (Was $169)\nHouse of Marley Get Together 2 Portable Speaker with Wireless Bluetooth Connectivity $184 (was $249)\nHouse of Marley Get Together 2 XL Portable Speaker with Wireless Bluetooth Connectivity $319 + 15% off clickable coupon (was $399)\nTREBLAB HD77 Premium Bluetooth Speaker $59.96 (was $119.97)\nTREBLAB FX100 Portable Bluetooth Speaker $39 (was $89.97)\nNakamichi Shockwafe Ultra 9.2.4 Dolby Atmos/DTS:X Soundbar with Dual Wireless 10″ Subs & 4 Rear Surround Speakers $1,049 (was $1,499)\nSony HTX8500 2.1ch Dolby Atmos/DTS:X Soundbar with Built-in subwoofer $198 (was $399)\nWiiM Pro AirPlay 2/Chromecast WiFi Multiroom Streamer $119.20 ($149)\nWiiM Pro Plus AirPlay 2/Chromecast Receiver w/ Premium AKM DAC $175.20 ($219)\nHouse of Marley Stir It Up Wireless Turntable with Bluetooth Connectivity, Built-in Preamp $198 (was $249)\nHouse of Marley Stir It Up Lux Vinyl Record Player with Wireless Bluetooth Connectivity, Built-in PreAmp 15% off clickable coupon (was $399)\nAnker SOLIX F2000 Portable Power Station, PowerHouse 767, 2400W Solar Generator $1,399 (was $1,999)\nAnker SOLIX F1200 Portable Power Station, PowerHouse 757, 1500W Solar Generator $699 (was $1,399)\nAnker SOLIX F2000 Portable Power Station, PowerHouse 767, 2048Wh GaNPrime Solar Generator $1,783 (was $2,594)\nAnker SOLIX F2000 Solar Generator, 2048Wh Portable Power Station with LiFePO4 Batteries and 400W Solar Panel $2,098 (was $2,998)\nAnker 555 Portable Power Station, 1024Wh Solar Generator $629 (was $899)\nAnker SOLIX F1200 Portable Power Station, PowerHouse 757, 1229Wh Solar Generator, with 100W Solar Panel $999 (was $1,599)\nAnker 535 Portable Power Station, 512Wh Solar Generator $349 (was $549)\nAnker 535 Solar Generator, Powerhouse 512Wh with 100W Solar Panel $559 (was $799)\nAnker 555 Solar Generator, Powerhouse 1024Wh with 2×100W Solar Panel $899 (was $1,049)\nBLUETTI Portable Power Station EB3A, 268Wh LiFePO4 Battery Backup $209 (was $349)\nBLUETTI Portable Power Station AC200MAX, 2048Wh LiFePO4 Battery Backup $1,299 (was $1,699)\nBLUETTI AC200P Portable Power Station, 2000Wh LiFePO4 Battery Backup $1,099 (was $2,399)\nBLUETTI Portable Power Station AC180, 1152Wh LiFePO4 Battery Backup $699 (was $999)\nBLUETTI Power Station AC500 & B300S Expansion Battery, 3072Wh LiFePO4 Battery Backup $3,359 (was $4,799)\nBLUETTI Solar Generator AC200MAX with 350W Solar Panel Included, 2048Wh Portable Power Station $1,893 (was $2,799)\nBLUETTI Solar Generator AC180 with PV200 Solar Panel Included, 1152Wh Portable Power Station $999 ($1,598)\nBLUETTI Solar Generator EB55 with PV120 Solar Panel Included, 537Wh Portable Power Station $489 (was $788)\nBLUETTI Solar Generator AC180 with PV350 Solar Panel Included, 1152Wh Portable Power Station $1,364 (was $1,999)\nBLUETTI Portable Power Station AC60 And B80 External Battery Module $978 (was $1,399)\nBLUETTI Solar Generator AC200P with 3 PV200 Solar Panels Included $2,396 (was $2,999)\nJackery Portable Power Station Explorer 300, 293Wh Backup Lithium Battery $199 (was $279)\nJackery Explorer 1000 Pro Portable Power Station $763 (was $1,099)\nJackery Solar Generator 2000 PRO 2160Wh Capacity with 1XSolar Panel SolarSaga 200W $1,549 (was $2,399)\nJackery Portable Power Station Explorer 240, 240Wh Backup Lithium Battery $167 (was $299)\nSony X80K $648 (Was $699.99)\nSony X85K $698 (Was $849.99)\nSony XR65X90L $1,098 (Was $1,499.99)\nSony XR A80L $1,798 (Was $1,998)\nSony X93L $1,698 (Was $1,898)\nSony KD43X77L, $398 (Was $449.99)\nSony X93L $3,798 (Was $4,499.99)\nHisense 65U6K $548 (Was $799.99)\nHisense 55U8K $748 (Was $1,099.99)\nHisense U6HF $199.99 (Was $499.99)\nHisense 43A4H $178 (Was $239.99)\nHisense 50U6G $429.99 (Was $534)\nHisense 75U7K $997 (Was $1,499)\nHisense 85U8K $1,799 (Was $2,699)\nTCL QM8 $1,498 (Was $2,299.99)\nTCL S3 $179.99 (Was $229.99)\nTCL 65S450F $379.99 (Was $529.99)\nTCL 50S450R $279.99 (Was $349.99)\nSamsung LS03B $1,597.99 (Was $1,997.99)\nSamsung M70B $299.99 (Was $399.99)\nSamsung CU7000 $667.99 (Was $747.99)\nSamsung Q80C $1,297.99 (Was $1,497.99)\nSamsung UN43CU8000FXZA $389 (Was $439.99)\nXGIMI MoGo 2 Pro 1080P Portable Projector with WiFi and Bluetooth $500 w/ clickable coupon (was $599)\nXGIMI MoGo 2 Portable Projector with WiFi and Bluetooth $299 (Was $399)\nXGIMI Horizon Pro 4K Projector $1,179 (Was $1,699)\nXGIMI Halo+ 1080P Portable Projector $649 (Was $849)\nXGIMI Aura 4K UHD Ultra Short Throw Laser Projector $1,599 (Was $1,999)\nRoku Express 4K+ $29 (Was $39)\nRoku Streaming Stick 4K $37.99 (Was $49)\nRoku Express 4K with Voice Remote Pro $49.99 (Was $59)\nRoku Streambar 4K HDR Streaming Device & Premium Roku Soundbar $99 (Was $129)\nEcho Pop $17.99 (Was $39.99)\nAmazon Echo Dot $22.99 (Was $49.99)\nEcho (4th Gen) $54.99 (Was $99.99)\nEcho Show 5 $39.99 (Was $89.99)\nEcho Studio $154.99 (Was $199.99)\nEcho Show 10 (3rd Gen) $159.99 (Was $249.99)\nAmazon Fire TV Stick with Alexa Voice Remote $19.99 (Was $39.99)\nAmazon Fire TV Stick 4K $22.99 (Was $49.99)\nAmazon Fire TV Cube $109.99 (Was $139.99)\nInsignia F30 Series LED 4K TV $169.99 (Was $269.99)\nAmazon Omni Series 4K TV $389.99 (Was $549.99)\nAmazon Omni QLED Series 4K TV $439.99 (Was $599.99)\nAmazon Fire 7 tablet $39.99 (Was $59.99)\nAmazon Fire HD 8 $59.99 (Was $99.99)\nAmazon Fire HD 10 $74.99 (Was $149.99)\nAmazon Fire HD 8 Kids Pro Tablet $74.99 (Was $149.99)\nAmazon Fire Max 11 $149.99 (Was $229.99)\nKindle Kids $79.99 (Was $119.99)\nKindle Paperwhite Kids $109.99 (Was $169.99)\nAmazon Kindle Scribe $289.99 (Was $369.99)\nRing Indoor Cam (2nd Gen) $29.99 (Was $59.99)\nRing Video Doorbell $54.99 (Was $99.99)\nRing Floodlight Cam Wired Plus $119.99 (Was $199.99)\nRing Video Doorbell Wired $34.99 (Was $64.99)\nRing Spotlight Cam Plus $119.99 (Was $169.99)\nRing Alarm 14-Piece Kit $197.99 (Was $329.99)\nRing Video Doorbell Pro $99.99 (Was $169.99)\nRing Battery Doorbell Plus $129.99 (Was $179.99)\nRing Floodlight Cam Wired Pro $199.99 (Was $249.99)\nRing Video Doorbell Pro 2 $149.99 (Was $249.99)\nRing Stick Up Cam $59.99 (Was $99.99)\nBlink Outdoor (3rd Generation) camera, $99.99 (Was $249.99)\nBlink Outdoor (3rd Generation) camera [2 pack], $99.99 (Was $249.99)\nBlink Outdoor (3rd Generation) camera [3 pack], $99.99 (Was $249.99)\nBlink Outdoor (3rd Generation) camera [5 pack], $189.99 (Was $379.99)\nBlink Outdoor (3rd Generation) camera [6 pack], $239.99 (Was $479.98)\neero mesh WiFi router $44.99 (Was $69.99)\neero 6 mesh WiFi system $159.99 (Was $199.99)\neero Pro 6 mesh WiFi 6 system $239.99 (Was $399.99)\neero 6+ mesh WiFi system $194.99 (Was $299.99)\neero Pro 6E mesh WiFi System $399.99 (Was $549.99)\niRobot Roomba s9+ Robot Vacuum $692 (Was $999.99)\nShark AV753 ION Robot Vacuum $129.99 (Was 229.99)\neufy Clean by Anker, RoboVac G30 Hybrid+, 2-in-1 $289.99 (Was $429.99)\neufy Clean X9 Pro CleanerBot with MopMaster $649.99 (Was $899.99)\nShark AW201 HydroVac Cordless Pro XL 3-in-1 Vacuum $199.99 (Was $300)\nShark NV356E Navigator Lift-Away Professional Upright Vacuum $159.99 (Was $199.99)\nShark IZ362H Anti-Allergen Cordless Lightweight Stick Vacuum $199.99 (Was $349.99)\neufy by Anker HomeVac H11 Cordless Handheld Vacuum Cleaner $35.99 (Was $59.99)\nKenmore DU5080 Bagless Upright Vacuum Lift Cleaner $169.99 (Was $199.99)\nKenmore DU5092 Bagless Upright Vacuum Carpet Cleaner $179.99 (Was $219.99)\nMiele Triflex HX2 Sprinter Vacuum Cleaner $711.75 (Was $949)\nHoover Power Scrub Deluxe Carpet Cleaner Machine $129.99 (Was $239.99)\nHoover MAXLife Pro Pet Swivel Bagless Upright Vacuum Cleaner $132.99 (Was $209.99)\nHoover Smartwash Automatic Carpet Cleaner $189.99 (Was $279.99)\nHoover ONEPWR WindTunnel Emerge Pet Cordless Lightweight Stick Vacuum $227 (Was $329.99)\nLEVOIT Cordless Vacuum Cleaner $167.99 (Was $239.99)\nParis Hilton Iconic Nonstick Pots and Pans Set $64 (Was $129.99)\nGreenLife Soft Grip Healthy Ceramic Nonstick 16 Piece Kitchen Set $79.99 (Was $119.99)\nGreenLife Soft Grip Healthy Ceramic Nonstick 23-Piece Set $129.99 (Was $199.99)\nNinja Foodi NeverStick PossiblePan Set with 4-Quart Capacity Pan, Steamer/Strainer Basket, Glass Lid & Integrated Spatula $79.99 (Was $129.99)\nNinja K32014 Foodi NeverDull Premium Knife System $179.99 (Was $299.99)\nLenox Lx Collective Black Accent Plates $59.97 (Was $69.95)\nOXO Good Grips 3-Piece Stainless Steel Mixing Bowl Set $41.97 (Was $59.95)\nOXO Good Grips 3-Piece Stainless-Steel Mixing Bowl Set, White $41.97 (Was $59.95)\nKitchenAid Hard Anodized Induction Nonstick Frying Pans/Skillet Set $78.99 (Was $109.99)\nAyesha Curry Home Collection Nonstick Cookware Pots and Pans Set $69.99 (Was $99.99)\nNuwave 18/8 Stainless Steel Ultimate Cookware Set $47.99 (Was $79.99)\nOster Convection Oven $139.99 (Was $199.99)\nOster Blender $69.54 (Was $109.99)\nNinja BL770AMZ Mega Kitchen System $119.99 (Was $199.99)\nNinja CFP307 DualBrew Pro Specialty Coffee System $149.99 (Was $239.99)\nMiele CM5300 Coffee System $799 (Was $1,399)\nMr. Coffee One-Touch CoffeeHouse+ Espresso $233.99 (Was $349.99)\nMr. Coffee Simple Grind 14 Cup Coffee Grinder $15.39 (Was $21.99)\nNUWAVE Brio 8-Qt Air Fryer $98.79 (Was $129.99)\nNUWAVE Bravo Air Fryer Toaster Oven Combo $169.99 (Was $199.99)\nGE Tilt-Head Electric Stand Mixer $149 (Was $299)\nGoveeLife Smart Electric Kettle Temperature Control $62.99 (Was $89.99)\nnutribullet Smart Touch Blender 1500W $83.99 (Was $139.99)\nnutribullet Pro+ 1200 Watt Personal Blender $79.99 (Was $119.99)\nLEVOIT Air Purifiers for Home Large Room with HEPA Filter $174.99 (Was $249.99)\nLEVOIT LV600S Smart Warm and Cool Mist Humidifier $93.49 (Was $109.99)\nLEVOIT Smart Cool Mist Top Fill Humidifier $46.49 (Was $54.99)\nLEVOIT (Last 60-Hour) Humidifier $68.59 (Was $78.99)\nNuwave Air Purifiers for Home Large Room Up to 1361 Sq Ft $110.49 (Was $129.99)\nKenmore PM2010 Air Purifier with H13 True HEPA Filter $119.99 (Was $149.99)\nGoveeLife Smart Dehumidifier for Basement $139.99 (Was $199.99)\nGoveeLife 36″ Smart Tower Fan for Bedroom $62.99 (Was $89.99)\nGoveeLife Smart Humidifier for Bedroom $32.19 (Was $45.99)\nGoveeLife Smart Space Heater $34.99 (Was $49.99)\n \n \n \n \n ",
        "Link on the Article": "https://futurism.com/amazon-prime-day-deals-october-2023"
    },
    {
        "Title": "Twitter CEO Says That Due to Reasons, She Has to Cancel Appearance Defending Elon Musk’s Deranged Behavior",
        "Article Content": "Looks like X-formerly-Twitter CEO Linda Yaccarino's speaking tour is on pause for the foreseeable future.\nYaccarino announced that she has bowed out of her scheduled appearance at The Wall Street Journal's Tech Live conference, slated to kick off next week.\nAccording to X, she's busy.\n\"With the global crisis unfolding, Linda and her team must remain fully focused on X platform safety,\" reads X's official statement shared by WSJ tech columnist Joanna Stern, likely referring to the situation in Israel and Gaza.\nBut considering Yaccarino's disastrous appearance at a conference last month and X owner Elon Musk's continuing promotion of notorious, misinformation-peddling accounts on the platform, there's clearly a lot more behind her decision.\nLate last month, Yaccarino sat down with CNBC's Julia Boorstin at Code, The Verge's annual tech and business conference. The bizarre interview was nothing short of a trainwreck. Among other odd claims and confrontational behavior, as recapped by The Verge, Yaccarino made sweeping statements about X's user figures without actually providing any hard numbers to back them up.\nShe also said Boorstin was \"not nice\" in response to an arguably fair question concerning Yaccarino's reputation as \"CEO in name only,\" and downplayed online threats directed at Yoel Roth, Twitter's former head of trust and safety who was forced to leave his home after being accused of pedophilia by Musk.\nOn that note, throughout the conversation, Yaccarino oscillated between defending and clumsily attempting to side-step questions regarding the behavior of the platform's mercurial owner, who — despite having passed on the CEO role to the #girlboss in question — continues to announce surprise site changes and product rollouts in X posts and threatening to sue nonprofits like the Anti-Defamation League for calling attention to antisemitism on the platform.\nTo be clear, focusing on the violent crisis in Israel and Gaza would be a worthy way for Yaccarino to spend her time, considering that X has been flooded with disinformation pertaining to the bloody conflict and, as the result of Musk's mass workforce cullings, seemingly no longer has the trust and safety staff required to manage content related to these kinds of global events.\nIt also doesn't help that in a now-deleted post on the platform, Musk, told users over the weekend that two notorious accounts that promote lies and unverifiable news are a good way to follow \"the war in real-time,\" per The Washington Post.\nSo, yeah, Yaccarino has a lot on her hands. Still, it's hard to believe that her decision to cancel her Tech Live appearance has nothing to do with her most recent onstage performance.\nAt the same time, when it comes to having to stand up for Musk's actions and confront his questionable behavior, we wouldn't want to publicly answer any questions, either.",
        "Link on the Article": "https://futurism.com/twitter-ceo-cancel-appearance-elon-musk"
    }
]